In [1]:
import pandas as pd

In [16]:
file_path = '../SP500_data/2004.csv'
df = pd.read_csv(file_path)
df['Open'] = pd.to_numeric(df['Open'].str.replace(',', ''))
df['Close'] = pd.to_numeric(df['Close'].str.replace(',', ''))
df['Average'] = (df['Open'] + df['Close']) / 2

           Date     Open      High       Low    Close  Average
0    12/31/2004  1211.92  1,217.33  1,211.65  1211.92  1211.92
1    12/30/2004  1213.55  1,216.47  1,213.41  1213.55  1213.55
2    12/29/2004  1213.45  1,213.95  1,210.95  1213.45  1213.45
3    12/28/2004  1213.54  1,213.54  1,204.92  1213.54  1213.54
4    12/27/2004  1204.92  1,214.17  1,204.92  1204.92  1204.92
..          ...      ...       ...       ...      ...      ...
247  01/08/2004  1131.92  1,131.92  1,124.91  1131.92  1131.92
248  01/07/2004  1126.33  1,126.33  1,116.45  1126.33  1126.33
249  01/06/2004  1123.67  1,124.46  1,118.44  1123.67  1123.67
250  01/05/2004  1122.22  1,122.22  1,108.48  1122.22  1122.22
251  01/02/2004  1108.48  1,118.85  1,105.08  1108.48  1108.48

[252 rows x 6 columns]

In [17]:
display(df)

           Date     Open      High       Low    Close  Average
0    12/31/2004  1211.92  1,217.33  1,211.65  1211.92  1211.92
1    12/30/2004  1213.55  1,216.47  1,213.41  1213.55  1213.55
2    12/29/2004  1213.45  1,213.95  1,210.95  1213.45  1213.45
3    12/28/2004  1213.54  1,213.54  1,204.92  1213.54  1213.54
4    12/27/2004  1204.92  1,214.17  1,204.92  1204.92  1204.92
..          ...      ...       ...       ...      ...      ...
247  01/08/2004  1131.92  1,131.92  1,124.91  1131.92  1131.92
248  01/07/2004  1126.33  1,126.33  1,116.45  1126.33  1126.33
249  01/06/2004  1123.67  1,124.46  1,118.44  1123.67  1123.67
250  01/05/2004  1122.22  1,122.22  1,108.48  1122.22  1122.22
251  01/02/2004  1108.48  1,118.85  1,105.08  1108.48  1108.48

[252 rows x 6 columns]

In [20]:
df['Date'] = pd.to_datetime(df['Date'])
df_sorted = df.sort_values(by='Date')
weekly_avg = df_sorted.resample('W-Mon', on='Date')['Average'].mean()
weekly_avg_change = weekly_avg.diff()
weekly_avg_change.iloc[0] = 0

In [21]:
weekly_avg_change

Date
2004-01-05     0.0000
2004-01-12    10.8520
2004-01-19     4.7030
2004-01-26    14.5450
2004-02-02   -10.8440
2004-02-09     0.1360
2004-02-16    15.5630
2004-02-23    -2.1110
2004-03-01    -2.4800
2004-03-08     6.1060
2004-03-15   -32.5580
2004-03-22    -6.8720
2004-03-29    -7.3900
2004-04-05    30.5520
2004-04-12     7.7505
2004-04-19   -11.9265
2004-04-26     0.2840
2004-05-03   -11.8200
2004-05-10   -11.6620
2004-05-17   -14.3840
2004-05-24    -2.1280
2004-05-31    25.8215
2004-06-07     7.6625
2004-06-14     8.6675
2004-06-21    -1.2295
2004-06-28     4.7920
2004-07-05    -4.5400
2004-07-12   -18.6780
2004-07-19    -7.0440
2004-07-26   -13.1840
2004-08-02     5.8700
2004-08-09   -18.1620
2004-08-16    -9.2020
2004-08-23    19.9880
2004-08-30    10.2040
2004-09-06     7.8905
2004-09-13    10.6155
2004-09-20     3.4520
2004-09-27   -11.6200
2004-10-04     8.2520
2004-10-11     9.5200
2004-10-18   -18.5420
2004-10-25   -11.4140
2004-11-01    24.1420
2004-11-08    28.3660
2004-11-15    20.3960
2004-11-22     4.0100
2004-11-29     2.2800
2004-12-06     7.4080
2004-12-13    -0.2260
2004-12-20    13.0740
2004-12-27     7.2815
2005-01-03     5.5975
Freq: W-MON, Name: Average, dtype: float64